backend/load-test.yml
config:
  target: "https://fixy-web.onrender.com"
  phases:
    - duration: 10
      arrivalRate: 10000
      name: "Fase 5 - Stress test 99990 usuarios/seg"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login de usuario existente"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "andre.ancco@tecsup.edu.pe"
            password: "al955tec1845"
          expect:
            - statusCode: 200

  - name: "Login con credenciales incorrectas"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "fake@tecsup.edu.pe"
            password: "passwordincorrecta"
          expect:
            - statusCode: 401

  - name: "Login sin body"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: ""
            password: ""
          expect:
            - statusCode: 400

  - name: "Registro con email invalido"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "usuario@gmail.com"
            password: "Password123"
            name: "Test User"
          expect:
            - statusCode: 400

  - name: "Registro con datos validos"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "loadtest.user@tecsup.edu.pe"
            password: "TestPass123"
            name: "Load Test User"
          expect:
            - statusCode: 400